---
kind: method
id: M:Autodesk.Revit.DB.RenderingSettings.GetRenderingQualitySettings
source: html/091b888e-4712-9cd4-32ca-3932de0c13c3.htm
---
# Autodesk.Revit.DB.RenderingSettings.GetRenderingQualitySettings Method

Returns an object that represents the rendering quality settings.

## Syntax (C#)
```csharp
public RenderingQualitySettings GetRenderingQualitySettings()
```

## Returns
The rendering quality settings.